Revit 2027 API
ParameterTypeId.RoomPerimeter Property
 "Perimeter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomPerimeter { get; }
Public Shared ReadOnly Property RoomPerimeter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomPerimeter {
	ForgeTypeId^ get ();
}
static member RoomPerimeter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace